## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                    |
|--------|---------------------------------------------------------------------------|
| add    | `aws_route_table.notification-canada-ca-private-db-reader_subnet[0]`      |
|        | `aws_route_table.notification-canada-ca-private-db-reader_subnet[1]`      |
|        | `aws_route_table_association.notification-canada-ca-private-db-reader[0]` |
|        | `aws_route_table_association.notification-canada-ca-private-db-reader[1]` |
|        | `aws_subnet.notification-canada-ca-private-separate-db-reader[0]`         |
|        | `aws_subnet.notification-canada-ca-private-separate-db-reader[1]`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route_table.notification-canada-ca-private-db-reader_subnet[0] will be created
  + resource "aws_route_table" "notification-canada-ca-private-db-reader_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0040087721da72045"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table for DB reader 0"
        }
      + tags_all         = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table for DB reader 0"
        }
      + vpc_id           = "vpc-097508d1f5e243195"
    }

  # aws_route_table.notification-canada-ca-private-db-reader_subnet[1] will be created
  + resource "aws_route_table" "notification-canada-ca-private-db-reader_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0c510b715c0b4a152"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table for DB reader 1"
        }
      + tags_all         = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table for DB reader 1"
        }
      + vpc_id           = "vpc-097508d1f5e243195"
    }

  # aws_route_table_association.notification-canada-ca-private-db-reader[0] will be created
  + resource "aws_route_table_association" "notification-canada-ca-private-db-reader" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.notification-canada-ca-private-db-reader[1] will be created
  + resource "aws_route_table_association" "notification-canada-ca-private-db-reader" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.notification-canada-ca-private-separate-db-reader[0] will be created
  + resource "aws_subnet" "notification-canada-ca-private-separate-db-reader" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"     = "private"
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet for database-tools (DB Reader) {count.index + 1}"
        }
      + tags_all                                       = {
          + "Access"     = "private"
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet for database-tools (DB Reader) {count.index + 1}"
        }
      + vpc_id                                         = "vpc-097508d1f5e243195"
    }

  # aws_subnet.notification-canada-ca-private-separate-db-reader[1] will be created
  + resource "aws_subnet" "notification-canada-ca-private-separate-db-reader" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"     = "private"
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet for database-tools (DB Reader) {count.index + 1}"
        }
      + tags_all                                       = {
          + "Access"     = "private"
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet for database-tools (DB Reader) {count.index + 1}"
        }
      + vpc_id                                         = "vpc-097508d1f5e243195"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_private_subnets_separate_reader_db              = [
      + (known after apply),
      + (known after apply),
    ]

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 51 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical[0]"]
WARN -...
```

</details>
